ThirdParty-v1912/swak4Foam-latest/Examples/BasicSourceSubclasses/pitzDailyWithSwirl/constant/sourcesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

swirl
{
    type vectorSwakSetValue;

    active true;
    timeStart 0;
    duration 1e7;
    selectionMode all;

    vectorSwakSetValueCoeffs {
        useMaskExpression true;
        maskExpression "mag(pos()-center)<radius";

        variables (
            "speed=1000;"
            "center=vector(0.05,0,0);"
            "radius=0.015;"
        );

        expressions {
            U "vector(0,0,speed)^(pos()-center)";
        }
    }
}


// ************************************************************************* //
